/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eyohn <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/05 09:32:33 by eyohn             #+#    #+#             */
/*   Updated: 2020/08/05 16:51:25 by eyohn            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "function.h"

int main(int argc, char **argv)
{
	int d;	// число получаемое в результате вычислений

	d = 123;
	printf("%d\n", argc);
	printf("%s\n", argv[0]);
	if (argc > 4 || argc < 4) // проверяем количество аргументов
		return (0);
	// принимаем на входе три аргумента
	// проверяем каждый аргумент на соответствие условиям
	// производим вычисления
	ft_intchar(d);	// выводим результат
	return (0);
}
